/*============================================================================================
 *
 *  (C) 2010, Phyton
 *
 *  Демонстрационный проект для 1986BE91 testboard
 *
 *  Данное ПО предоставляется "КАК ЕСТЬ", т.е. исключительно как пример, призванный облегчить
 *  пользователям разработку их приложений для процессоров Milandr 1986BE91T1. Компания Phyton
 *  не несет никакой ответственности за возможные последствия использования данного, или
 *  разработанного пользователем на его основе, ПО.
 *
 *--------------------------------------------------------------------------------------------
 *
 *  Файл joystick.c: Работа с набором кнопок ("джойстиком")
 *
 *============================================================================================*/

#include "MDR32F9Qx_port.h"
#include "joystick.h"

/* Маски и соответствие "кодам клавиш" */

#define No_Key_Pressed      0x7C00

static uc32 KeyMasks[NUM_KEY_CODES] = {
        No_Key_Pressed, /* NOKEY    */
        0x7800,         /* SEL      */
        0x3C00,         /* RIGHT    */
        0x5C00,         /* LEFT     */
        0x7400,         /* UP       */
        0x6C00          /* DOWN     */
};

/* Определение "кода" по нажатым кнопкам */
KeyCode GetKey(void) {
    u32 i, j, data;

    //data = PORTC->RXTX;
	data = PORT_ReadInputData(MDR_PORTC);

    if ((data & No_Key_Pressed) == No_Key_Pressed)
      return NOKEY;

    for (i = 1; i < NUM_KEY_CODES; i++) {
        for (j = 0; ((data & No_Key_Pressed) == KeyMasks[i]) && (j < 16); j++);
        if (j > 0)
            return j > 15 ? ((KeyCode)i) : NOKEY;
    }

    return MULTIPLE;
}

/*============================================================================================
 * Конец файла joystick.c
 *============================================================================================*/

