/*
*Программа AD16 KDG миландр 
*/


#include "MDR32Fx.h"
#include "MDR32F9Qx_config.h"
#include "MDR32F9Qx_port.h"
#include "MDR32F9Qx_rst_clk.h"
#include "MDR32F9Qx_timer.h"
#include "MDR32F9Qx_uart.h"
#include "MDR32F9Qx_iwdg.h"
#include "MDR32F9Qx_eeprom.h"
#include "MDR32F9Qx_ssp.h"
#include "MDR32F9Qx_adc.h"
#include <stdbool.h>

#include "MDR32F9Qx_power.h"
#include <string.h>
//#include <stdlib.h>

#include "types.h"

// Kernel includes
#include "FreeRTOSConfig.h"
#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"
#include "timers.h"
#include "semphr.h"

#include "death.h"





#define DEBUG_ON 0

#ifdef DEBUG_ON

#include <stdio.h>
#define ITM_Port8(n)    (*((volatile unsigned char *)(0xE0000000+4*n)))
#define ITM_Port16(n)   (*((volatile unsigned short*)(0xE0000000+4*n)))
#define ITM_Port32(n)   (*((volatile unsigned long *)(0xE0000000+4*n)))
#define DEMCR           (*((volatile unsigned long *)(0xE000EDFC)))
#define TRCENA          0x01000000


struct __FILE { int handle; /* Add whatever you need here */ };
FILE __stdout;
FILE __stdin;

int fputc(int ch, FILE *f) {
   if (DEMCR & TRCENA) {

while (ITM_Port32(0) == 0);
    ITM_Port8(0) = ch;
  }
  return(ch);
}


#endif







const char data_str[]=__DATE__;//mmm dd yyyy

#define EEPROM_ADD	(uint32_t)0x08000000	//page0



#define RS485_TX_OFF	PORT_ResetBits(MDR_PORTA, PORT_Pin_2)
#define RS485_TX_ON		PORT_SetBits(MDR_PORTA, PORT_Pin_2)

#define K1_OFF			PORT_ResetBits(MDR_PORTC, PORT_Pin_1)
#define K1_ON			PORT_SetBits(MDR_PORTC, PORT_Pin_1)
#define K2_OFF			PORT_ResetBits(MDR_PORTA, PORT_Pin_5)
#define K2_ON			PORT_SetBits(MDR_PORTA, PORT_Pin_5)
#define K3_OFF			PORT_ResetBits(MDR_PORTF, PORT_Pin_3)
#define K3_ON			PORT_SetBits(MDR_PORTF, PORT_Pin_3)
#define K4_OFF			PORT_ResetBits(MDR_PORTF, PORT_Pin_5)
#define K4_ON			PORT_SetBits(MDR_PORTF, PORT_Pin_5)
#define K5_OFF			PORT_ResetBits(MDR_PORTF, PORT_Pin_6)
#define K5_ON			PORT_SetBits(MDR_PORTF, PORT_Pin_6)
#define K6_OFF			PORT_ResetBits(MDR_PORTE, PORT_Pin_0)
#define K6_ON			PORT_SetBits(MDR_PORTE, PORT_Pin_0)
#define K6_TOGLE		MDR_PORTE->RXTX ^= PORT_Pin_0	
#define K7_OFF			PORT_ResetBits(MDR_PORTE, PORT_Pin_1)
#define K7_ON			PORT_SetBits(MDR_PORTE, PORT_Pin_1)
#define K8_OFF			PORT_ResetBits(MDR_PORTE, PORT_Pin_7)
#define K8_ON			PORT_SetBits(MDR_PORTE, PORT_Pin_7)
#define K9_OFF			PORT_ResetBits(MDR_PORTB, PORT_Pin_10)
#define K9_ON			PORT_SetBits(MDR_PORTB, PORT_Pin_10)
#define K10_OFF			PORT_ResetBits(MDR_PORTC, PORT_Pin_2)
#define K10_ON			PORT_SetBits(MDR_PORTC, PORT_Pin_2)
#define K11_OFF			PORT_ResetBits(MDR_PORTA, PORT_Pin_4)
#define K11_ON			PORT_SetBits(MDR_PORTA, PORT_Pin_4)
#define K11_TOGGLE		MDR_PORTA->RXTX ^= PORT_Pin_4
#define K12_OFF			PORT_ResetBits(MDR_PORTF, PORT_Pin_0)
#define K12_ON			PORT_SetBits(MDR_PORTF, PORT_Pin_0)
#define K13_OFF			PORT_ResetBits(MDR_PORTF, PORT_Pin_1)
#define K13_ON			PORT_SetBits(MDR_PORTF, PORT_Pin_1)

#define TPR_UP_ON		PORT_ResetBits(MDR_PORTF, PORT_Pin_2)
#define TPR_UP_OFF		PORT_SetBits(MDR_PORTF, PORT_Pin_2)
#define TPR_DOWN_ON		PORT_ResetBits(MDR_PORTF, PORT_Pin_4)
#define TPR_DOWN_OFF	PORT_SetBits(MDR_PORTF, PORT_Pin_4)


volatile struct 
{
	uint16_t Ndiz;		//0
	uint16_t FreqU;		//1
	uint16_t UDG;		//2
	uint16_t UBS;		//3
	uint16_t Igen;		//4
	uint8_t DM;			//5
	uint8_t TOJ;		//6
	uint8_t TBap;		//7
	uint8_t LvlDIZ;		//8
	uint16_t RegWrk;	//9
	uint8_t Isol;		//10
	uint8_t Led;		//11
	uint16_t RegSDG;	//12
	uint16_t Error;		//13
	uint16_t RegimTime; //14
	uint16_t RegimError;//15
	bool protOFF;		//16
	uint16_t d_U;		//17
	uint16_t d_F;		//18
	uint32_t KWH;	//19
	uint32_t time;	//20
	uint8_t spt_time;	//21
} StatusDG = { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,0,0,0,0 };//{ 1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16 };

						
volatile struct 
{
	uint8_t ADCF;	//0
	uint8_t ADCU;	//1
	uint16_t RegSMU;	//3
	uint8_t CurrPosLCD;	//4
} StatusMU, StatusDU;






//CRC16_TABLE_LOCATION poly 0xA001.
const uint8_t high[ 256 ]=
{ /*1 	2 		3 	4 		5 	6 		7 	8 		9 	10 		11 	12 		13 	14 		15 	16 */
 0x00, 0xc1, 0x81, 0x40, 0x01, 0xc0, 0x80, 0x41, 0x01, 0xc0, 0x80, 0x41, 0x00, 0xc1, 0x81, 0x40,	/* 1 */
 0x01, 0xc0, 0x80, 0x41, 0x00, 0xc1, 0x81, 0x40, 0x00, 0xc1, 0x81, 0x40, 0x01, 0xc0, 0x80, 0x41,	/* 2 */
 0x01, 0xc0, 0x80, 0x41, 0x00, 0xc1, 0x81, 0x40, 0x00, 0xc1, 0x81, 0x40, 0x01, 0xc0, 0x80, 0x41,	/* 3 */
 0x00, 0xc1, 0x81, 0x40, 0x01, 0xc0, 0x80, 0x41, 0x01, 0xc0, 0x80, 0x41, 0x00, 0xc1, 0x81, 0x40,	/* 4 */
 0x01, 0xc0, 0x80, 0x41, 0x00, 0xc1, 0x81, 0x40, 0x00, 0xc1, 0x81, 0x40, 0x01, 0xc0, 0x80, 0x41,	/* 5 */
